![png](books.png)

In [8]:
#imports
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [1]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [5]:
engine = create_engine(connection)

In [6]:
create_database(connection)

In [7]:
database_exists(connection)

True

In [9]:
df_users = pd.read_csv('data/users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [13]:
df_users.to_sql('user', engine, if_exists = 'replace')

3

In [11]:
df_books = pd.read_csv('data/books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [14]:
df_books.to_sql('book', engine, if_exists = 'replace')

6

In [15]:
df_authors = pd.read_csv('data/authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [16]:
df_authors.to_sql('author', engine, if_exists = 'replace')

5

In [17]:
df_faves = pd.read_csv('data/favorites.csv')
df_faves.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [18]:
df_faves.to_sql('favorites', engine, if_exists = 'replace')

7

In [19]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0          author
1            book
2       favorites
3            user

In [20]:
q1 = """SELECT book.title, favorites.user_id
FROM book
JOIN favorites ON book.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT user.id FROM user WHERE (user.last_name = "Doe" AND user.first_name = "John"));"""
pd.read_sql(q1, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1